package com.Equipment;

import ir.noghteh.JustifiedTextView;
import IranSoftjo.Abdasht.R;
import android.os.Bundle;
import android.widget.ImageView;
import android.widget.TextView;

public class AtivityEquipment1_1 extends ExtendActivityWithTitle {
	private JustifiedTextView mJTv;

	@Override
	protected void onCreate(Bundle savedInstanceState) {
		super.onCreate(savedInstanceState);
		setContentView(R.layout.activity_equipment1_1);
		setvalue();

		ImageView img = (ImageView) findViewById(R.id.imageEquipment);
		img.setImageResource(R.drawable.equipment1_1);

		// TextView txt = (TextView) findViewById(R.id.txtEquipment);
		// txt.setText("سردوش¬های تلفنی و علمکی با قابلیت اختلاط آب و هوا در کاهش زمان دوش گرفتن و همچنین در کاهش مصرف آب در حمام نقش بسزایی دارند. ");

		mJTv = (JustifiedTextView) findViewById(R.id.txtEquipment);
		mJTv.setText("مطابق تحقيقات انجام گرفته"
				+ " در ساير کشورها، مصرف آب حمام بعد از توالت ها دومين رتبه استفاده از آب در "
				+ "ساختمان هاي مسکوني را دارا مي باشد."
				+ "\n"
				+ " حجم آب مورد استفاده در حمام، به دبي جريان خروجي "
				+ "از سر دوشي ها و طول مدت استفاده از حمام بستگي دارد. لذا کاهش زمان استحمام و همچنين"
				+ " کاهش دبي خروجي از سر دوشي بايد مستقلاً مد نظر قرار گيرد."
				+ "\n"
				+ " در مورد کاهش زمان استحمام،"
				+ " بايد با فرهنگ سازي و آگاهي بخشي به مردم، فرهنگ استفاده از حمام را تصحيح نمود."
				+ " کاهش دبي سر دوشي ها، با اصلاح عملکرد فيزيکي سر دوشي ها ميسر می شود."
				+ "\n"
				+ " مصرف دوشهاي متداول که بدون به کارگيري هر نوع کاهنده اي مي باشند،"
				+ " در حدود 18 ليتر در دقيقه است. با احتساب 5 دقيقه براي استحمام هر نفر،"
				+ " در حدود 90 ليتر آب پاکيزه با هر بار دوش گرفتن به شبکه فاضلاب وارد مي‌شود."
				+ " به منظور کاهش مصرف، سر دوشي هاي جديد با هدف جايگزيني سردوشي هاي قديمي و "
				+ "کاهش مصرف توليد شدند."
				+ "\n"
				+ " در طراحي سر دوشي هاي کم مصرف، با محدود نمودن اريفيس خروجي"
				+ "، دبي جريان به 10 ليتر در دقيقه کاهش يافته است. استفاده از اين نوع سر دوشي منجر "
				+ "به 44 درصد صرفه جويي در مصرف آب خواهد شد. با به کار گيري تکنولوژي اسپري هوا و "
				+ "مخلوط نمودن آب و هوا، مي توان مصرف آب سر دوشي ها را به حدود 3 تا 5/5 (میانگین 4) ليتر "
				+ "در دقيقه کاهش داد. استفاده از اين نوع دوشها براي استحمام 5 دقيقه اي "
				+ "در مقايسه با دوشهاي معمولي نزديک به 70 ليتر صرفه جويي به همراه خواهد داشت."
				+ " البته کاهش مصرف آب با توجه به رضايت مشتري از محصول و استفاده از آن صورت گرفته است."
				+ " اين موضوع را مي توان در گزارشهاي مکرر سازمانهاي ذيربط مشاهده کرد. در اينگونه محصولات،"
				+ " ترکيب فشار هوا و نيروي گرانشي منجر به افزايش سرعت آب خروجي از سردوشي ها شده و"
				+ " به اين ترتيب کارايي استفاده از سر دوشي ها افزايش مي يابد. استفاده از اين نوع سردوشي ها"
				+ " باعث کاهش 60 درصد صرفه جويي نسبت به استفاده از سردوشي هاي بدون کاهنده خواهد شد."
				+ " همچنين نسبت به دوشهاي کم مصرف 30 درصد صرفه جويي را در پی خواهد داد.");

	}
}